saewoonam/ble_adv_covid/nrf52 dongle/usbd_ble_covid/main.c
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}
*/

/**
 * @brief Function for putting the chip into sleep mode.
 *
 * @note This function does not return.
 */
static void sleep_mode_enter(void)
{
    uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    ret_code_t err_code;

    err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);

    //err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
    //APP_ERROR_CHECK(err_code);
}

/**
 * @brief Function for handling advertising events.
 *
 * @details This function is called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            err_code = app_timer_start(m_blink_ble,
                                       APP_TIMER_TICKS(LED_BLINK_INTERVAL),
                                       (void *) LED_BLE_NUS_CONN);
            APP_ERROR_CHECK(err_code);
            break;
        case BLE_ADV_EVT_IDLE:
            NRF_LOG_INFO("Advertising timeout, restarting.")
            advertising_start();
            break;
        default:
            break;
    }
}

NRF_BLE_SCAN_DEF(m_scan);  
/**@brief Function to start scanning. */
static void scan_start(void)
{
    ret_code_t ret;

    ret = nrf_ble_scan_start(&m_scan);
    APP_ERROR_CHECK(ret);

   // ret = bsp_indication_set(BSP_INDICATE_SCANNING);
   // APP_ERROR_CHECK(ret);
}
/**@brief Function for initializing the scanning and setting the filters.
 */

static ble_uuid_t const contact_uuid =
{
    .uuid = 0xFD6F,
    .type = BLE_UUID_TYPE_BLE 
};

static void scan_init(void)
{
    ret_code_t          err_code;
    nrf_ble_scan_init_t init_scan;

    memset(&init_scan, 0, sizeof(init_scan));

    init_scan.connect_if_match = false;
    init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

    //err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
    err_code = nrf_ble_scan_init(&m_scan, &init_scan, NULL);
    APP_ERROR_CHECK(err_code);

    
    err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_UUID_FILTER, &contact_uuid);
    APP_ERROR_CHECK(err_code);
    
    err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_UUID_FILTER, false);
    APP_ERROR_CHECK(err_code);
    
}

int frame_counter=0;

/**
 * @brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static int check_for_service(uint8_t *data, uint8_t length, uint8_t *uuid)
{
    uint8_t *ptr;
    ptr = data;
    uint8_t index = 0;
    uint8_t sublength;
    uint8_t ad_type;
    bool result = false;

    if (length>0) {
        do {
            sublength = ptr[0];
            ad_type = ptr[1];
            if (sublength==2) {  // its a flag
                ;
            } else if (sublength==3) {
                result = result || ((ptr[2]==uuid[0]) && (ptr[3]==uuid[1]));
            }
            ptr += sublength + 1;
            index += sublength + 1;
        } while (index < length);
    } 
    return result;
}

uint8_t contact[2] = {0x6F, 0xFD};

static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    uint32_t err_code;
    size_t size=0;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            break;

        case BLE_GAP_EVT_ADV_REPORT:
        {       
            ble_gap_evt_adv_report_t const* adv = &p_ble_evt->evt.gap_evt.params.adv_report;
            if (cdc_open) {  // Only send stuff if serial port is open
              while (ready==0) {nrfx_coredep_delay_us(1000);} // wait until previous TX is done
              // build message
              bool contact_bool = check_for_service(adv->data.p_data, adv->data.len, contact);
              if (contact_bool) {
                  // size = sprintf(m_tx_buffer, "%d ", adv->rssi);
                  // size = sprintf(m_tx_buffer+size, " id: %02x ", adv->data_id);
                  /*
                  size += sprintf(m_tx_buffer+size, "[%02x:%02x:%02x:%02x:%02x:%02x]",
                          adv->peer_addr.addr[5], adv->peer_addr.addr[4], adv->peer_addr.addr[3],
                          adv->peer_addr.addr[2], adv->peer_addr.addr[1], adv->peer_addr.addr[0]);
                  */

                  // size += sprintf(m_tx_buffer+size, " contact: %d", contact_bool);
                  // size += sprintf(m_tx_buffer+size, " dlen: %d", adv->data.len);
                  
                  if (adv->data.len>0) {
                    for (uint8_t i=0; i<adv->data.len; i++) {
                      //if (i>0) size+=sprintf(m_tx_buffer+size, "-");
                      size+= sprintf(m_tx_buffer+size, "%02x", adv->data.p_data[i]);
                    }  
                  }
                  size += sprintf(m_tx_buffer+size, "\n");
              }

              ready=0;
              err_code = app_usbd_cdc_acm_write(&m_app_cdc_acm, m_tx_buffer, size);
              APP_ERROR_CHECK(err_code);
              //size = sprintf(m_tx_buffer, " rss: %df\r\n", evt_report->rssi);
              //err_code = app_usbd_cdc_acm_write(&m_app_cdc_acm, m_tx_buffer, size);
              //APP_ERROR_CHECK(err_code);
            }
            break;
        }
        default:
            // No implementation needed.
            break;
    }
}


/**
 * @brief Function for the SoftDevice initialization.
 *
 * @details This function initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}

/**
 * @brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;
    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT: /*
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            } */
            break;

        case BSP_EVENT_WHITELIST_OFF:
            break;

        default:
            break;
    }
}

static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    uint8_t       flags = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;
    
    flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    

    // Initialize advertising parameters (used when starting advertising).
    memset(&m_adv_params, 0, sizeof(m_adv_params));

